Revit.Elements.Views.Legend
A Revit Legend View Wrapper

Revit.Elements.Views.Legend.InternalLegend
An internal handle on the Revit element

Revit.Elements.Views.Legend.InternalElement
Reference to the Element

Revit.Elements.Views.Legend.#ctor(Autodesk.Revit.DB.View)
Private constructor

Revit.Elements.Views.Legend.InitLegend(Autodesk.Revit.DB.View)
Initialize a Legend element

Revit.Elements.Views.Legend.InternalSetLegend(Autodesk.Revit.DB.View)
Set the Internal Legend properties and the associated Element Id and Unique Id
view:

Revit.Elements.Views.Legend.FromExisting(Autodesk.Revit.DB.View,System.Boolean)
Create a View from a user selected Element.
view:
isRevitOwned:
Returns: